turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LS8B.atdf
        <module name="IISC" id="I7560" version="1.0.0">
          <instance name="IISC">
            <register-group name="IISC" name-in-module="IISC" address-space="base" offset="0x40004000"/>
            <signals>
              <signal group="IMCK" function="D" pad="PB05"/>
              <signal group="IMCK" function="B" pad="PA31"/>
              <signal group="ISCK" function="D" pad="PB02"/>
              <signal group="ISCK" function="B" pad="PA27"/>
              <signal group="ISDI" function="D" pad="PB03"/>
              <signal group="ISDI" function="B" pad="PA28"/>
              <signal group="ISDO" function="D" pad="PB04"/>
              <signal group="ISDO" function="B" pad="PA30"/>
              <signal group="IWS" function="D" pad="PB06"/>
              <signal group="IWS" function="B" pad="PA29"/>
            </signals>
            <parameters>
              <param name="GCLK_NUM" value="6"/>
              <param name="PDCA_ID_RX" value="14"/>
              <param name="PDCA_ID_RX_1" value="15"/>
              <param name="PDCA_ID_TX" value="33"/>
              <param name="PDCA_ID_TX_1" value="34"/>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="PARC" id="I7570" version="1.0.0">
          <instance name="PARC">
            <register-group name="PARC" name-in-module="PARC" address-space="base" offset="0x4006C000"/>
            <signals>
              <signal group="PCCK" function="D" pad="PA17"/>
              <signal group="PCDATA" index="0" function="D" pad="PA09"/>
              <signal group="PCDATA" index="1" function="D" pad="PA10"/>
              <signal group="PCDATA" index="2" function="D" pad="PA11"/>
              <signal group="PCDATA" index="3" function="D" pad="PA12"/>
              <signal group="PCDATA" index="4" function="D" pad="PA13"/>
              <signal group="PCDATA" index="5" function="D" pad="PA14"/>
              <signal group="PCDATA" index="6" function="D" pad="PA15"/>
              <signal group="PCDATA" index="7" function="D" pad="PA16"/>
              <signal group="PCEN1" function="D" pad="PA18"/>
              <signal group="PCEN2" function="D" pad="PA19"/>
            </signals>
            <parameters>
              <param name="PDCA_ID_RX" value="16"/>
              <param name="INSTANCE_ID" value="18"/>
            </parameters>
          </instance>
        </module>
        <module name="PDCA" id="I7514" version="1.2.4">
          <instance name="PDCA">
            <register-group name="PDCA" name-in-module="PDCA" address-space="base" offset="0x400A2000"/>
            <parameters>
              <param name="CHANNEL_LENGTH" value="16"/>
              <param name="MON_CH0_IMPL" value="0"/>
              <param name="MON_CH1_IMPL" value="0"/>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="PEVC" id="I7533" version="2.0.0">
          <instance name="PEVC">
            <register-group name="PEVC" name-in-module="PEVC" address-space="base" offset="0x400A6000"/>
            <signals>
              <signal group="PAD_EVT" index="0" function="C" pad="PA08"/>
              <signal group="PAD_EVT" index="0" function="C" pad="PB12"/>
              <signal group="PAD_EVT" index="1" function="C" pad="PA09"/>
              <signal group="PAD_EVT" index="1" function="C" pad="PB13"/>
              <signal group="PAD_EVT" index="2" function="C" pad="PA10"/>
              <signal group="PAD_EVT" index="2" function="B" pad="PB09"/>
              <signal group="PAD_EVT" index="3" function="C" pad="PA11"/>
              <signal group="PAD_EVT" index="3" function="B" pad="PB10"/>
            </signals>
            <parameters>
              <param name="EVIN_BITS" value="31"/>
              <param name="PADS_BITS" value="4"/>
              <param name="TRIGOUT_BITS" value="19"/>
              <param name="INSTANCE_ID" value="39"/>
            </parameters>
          </instance>
        </module>
        <module name="PICOUART" id="I8403" version="1.0.1">
          <instance name="PICOUART">
            <register-group name="PICOUART" name-in-module="PICOUART" address-space="base" offset="0x400F1400"/>
            <parameters>
              <param name="INSTANCE_ID" value="101"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="I7146" version="4.4.1">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x400E0000"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="AWEN_PICOUART" value="6"/>
              <param name="AWEN_TWIS0" value="0"/>
              <param name="AWEN_TWIS1" value="1"/>
              <param name="AWEN_USBC" value="2"/>
              <param name="MCCTRL_MCSEL_DFLL0" value="3"/>
              <param name="MCCTRL_MCSEL_FLO" value="7"/>
              <param name="MCCTRL_MCSEL_OSC0" value="1"/>
              <param name="MCCTRL_MCSEL_PLL0" value="2"/>
              <param name="MCCTRL_MCSEL_RCFAST" value="5"/>
              <param name="MCCTRL_MCSEL_RC1M" value="6"/>
              <param name="MCCTRL_MCSEL_RC80M" value="4"/>
              <param name="MCCTRL_MCSEL_SLOW" value="0"/>
              <param name="PM_CLK_APB_NUM" value="4"/>
              <param name="PPCR_FLASH_WAIT_BGREF_MASK" value="512"/>
              <param name="PPCR_FLASH_WAIT_BOD18_MASK" value="1024"/>
              <param name="SYSTEM_CLOCK" value="115000"/>
              <param name="PM_SMODE_DEEPSTOP" value="4"/>
              <param name="PM_SMODE_FROZEN" value="1"/>
              <param name="PM_SMODE_IDLE" value="0"/>
              <param name="PM_SMODE_SHUTDOWN" value="6"/>
              <param name="PM_SMODE_STANDBY" value="2"/>
              <param name="PM_SMODE_STATIC" value="5"/>
              <param name="PM_SMODE_STOP" value="3"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
            <clock-groups>
              <clock-group name="CPU" grouporder="0">
                <clock name="OCD" bit="0"/>
              </clock-group>
              <clock-group name="HSB" grouporder="1">
                <clock name="PDCA" bit="0"/>
                <clock name="HFLASHC" bit="1"/>
                <clock name="HRAMC1" bit="2"/>
                <clock name="USBC" bit="3"/>
                <clock name="CRCCU" bit="4"/>
                <clock name="HTOP0" bit="5"/>
                <clock name="HTOP1" bit="6"/>
                <clock name="HTOP2" bit="7"/>
                <clock name="HTOP3" bit="8"/>
              </clock-group>
              <clock-group name="PBA" grouporder="2">
                <clock name="IISC" bit="0"/>
                <clock name="SPI" bit="1"/>
                <clock name="TC0" bit="2"/>
                <clock name="TC1" bit="3"/>
                <clock name="TWIM0" bit="4"/>
                <clock name="TWIS0" bit="5"/>
                <clock name="TWIM1" bit="6"/>
                <clock name="TWIS1" bit="7"/>
                <clock name="USART0" bit="8"/>
                <clock name="USART1" bit="9"/>
                <clock name="USART2" bit="10"/>
                <clock name="USART3" bit="11"/>
                <clock name="ADCIFE" bit="12"/>
                <clock name="DACC" bit="13"/>
                <clock name="ACIFC" bit="14"/>
                <clock name="GLOC" bit="15"/>
                <clock name="ABDACB" bit="16"/>
                <clock name="TRNG" bit="17"/>
                <clock name="PARC" bit="18"/>
                <clock name="CATB" bit="19"/>
                <clock name="TWIM2" bit="21"/>
                <clock name="TWIM3" bit="22"/>
              </clock-group>
              <clock-group name="PBB" grouporder="3">
                <clock name="HFLASHC" bit="0"/>
                <clock name="HCACHE" bit="1"/>
                <clock name="HMATRIX" bit="2"/>
                <clock name="PDCA" bit="3"/>
                <clock name="CRCCU" bit="4"/>
                <clock name="USBC" bit="5"/>
                <clock name="PEVC" bit="6"/>
              </clock-group>
              <clock-group name="PBC" grouporder="4">
                <clock name="PM" bit="0"/>
                <clock name="CHIPID" bit="1"/>
                <clock name="SCIF" bit="2"/>
                <clock name="FREQM" bit="3"/>
                <clock name="GPIO" bit="4"/>
              </clock-group>
              <clock-group name="PBD" grouporder="5">
                <clock name="BPM" bit="0"/>
                <clock name="BSCIF" bit="1"/>
                <clock name="AST" bit="2"/>
                <clock name="WDT" bit="3"/>
                <clock name="EIC" bit="4"/>
                <clock name="PICOUART" bit="5"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
