turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LS8B.atdf
        <register name="SR" offset="0x4" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="ACCS0" caption="AC0 Current Comparison Status" mask="0x1"/>
          <bitfield name="ACRDY0" caption="AC0 Ready" mask="0x2"/>
          <bitfield name="ACCS1" caption="AC1 Current Comparison Status" mask="0x4"/>
          <bitfield name="ACRDY1" caption="AC1 Ready" mask="0x8"/>
          <bitfield name="ACCS2" caption="AC2 Current Comparison Status" mask="0x10"/>
          <bitfield name="ACRDY2" caption="AC2 Ready" mask="0x20"/>
          <bitfield name="ACCS3" caption="AC3 Current Comparison Status" mask="0x40"/>
          <bitfield name="ACRDY3" caption="AC3 Ready" mask="0x80"/>
          <bitfield name="ACCS4" caption="AC4 Current Comparison Status" mask="0x100"/>
          <bitfield name="ACRDY4" caption="AC4 Ready" mask="0x200"/>
          <bitfield name="ACCS5" caption="AC5 Current Comparison Status" mask="0x400"/>
          <bitfield name="ACRDY5" caption="AC5 Ready" mask="0x800"/>
          <bitfield name="ACCS6" caption="AC6 Current Comparison Status" mask="0x1000"/>
          <bitfield name="ACRDY6" caption="AC6 Ready" mask="0x2000"/>
          <bitfield name="ACCS7" caption="AC7 Current Comparison Status" mask="0x4000"/>
          <bitfield name="ACRDY7" caption="AC7 Ready" mask="0x8000"/>
          <bitfield name="WFCS0" caption="Window0 Mode Current Status" mask="0x1000000"/>
          <bitfield name="WFCS1" caption="Window1 Mode Current Status" mask="0x2000000"/>
          <bitfield name="WFCS2" caption="Window2 Mode Current Status" mask="0x4000000"/>
          <bitfield name="WFCS3" caption="Window3 Mode Current Status" mask="0x8000000"/>
        </register>
        <register name="IER" offset="0x10" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="ACINT0" caption="AC0 Interrupt Enable" mask="0x1"/>
          <bitfield name="SUTINT0" caption="AC0 Startup Time Interrupt Enable" mask="0x2"/>
          <bitfield name="ACINT1" caption="AC1 Interrupt Enable" mask="0x4"/>
          <bitfield name="SUTINT1" caption="AC1 Startup Time Interrupt Enable" mask="0x8"/>
          <bitfield name="ACINT2" caption="AC2 Interrupt Enable" mask="0x10"/>
          <bitfield name="SUTINT2" caption="AC2 Startup Time Interrupt Enable" mask="0x20"/>
          <bitfield name="ACINT3" caption="AC3 Interrupt Enable" mask="0x40"/>
          <bitfield name="SUTINT3" caption="AC3 Startup Time Interrupt Enable" mask="0x80"/>
          <bitfield name="ACINT4" caption="AC4 Interrupt Enable" mask="0x100"/>
          <bitfield name="SUTINT4" caption="AC4 Startup Time Interrupt Enable" mask="0x200"/>
          <bitfield name="ACINT5" caption="AC5 Interrupt Enable" mask="0x400"/>
          <bitfield name="SUTINT5" caption="AC5 Startup Time Interrupt Enable" mask="0x800"/>
          <bitfield name="ACINT6" caption="AC6 Interrupt Enable" mask="0x1000"/>
          <bitfield name="SUTINT6" caption="AC6 Startup Time Interrupt Enable" mask="0x2000"/>
          <bitfield name="ACINT7" caption="AC7 Interrupt Enable" mask="0x4000"/>
          <bitfield name="SUTINT7" caption="AC7 Startup Time Interrupt Enable" mask="0x8000"/>
          <bitfield name="WFINT0" caption="Window0 Mode Interrupt Enable" mask="0x1000000"/>
          <bitfield name="WFINT1" caption="Window1 Mode Interrupt Enable" mask="0x2000000"/>
          <bitfield name="WFINT2" caption="Window2 Mode Interrupt Enable" mask="0x4000000"/>
          <bitfield name="WFINT3" caption="Window3 Mode Interrupt Enable" mask="0x8000000"/>
        </register>
        <register name="IDR" offset="0x14" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="ACINT0" caption="AC0 Interrupt Disable" mask="0x1"/>
          <bitfield name="SUTINT0" caption="AC0 Startup Time Interrupt Disable" mask="0x2"/>
          <bitfield name="ACINT1" caption="AC1 Interrupt Disable" mask="0x4"/>
          <bitfield name="SUTINT1" caption="AC1 Startup Time Interrupt Disable" mask="0x8"/>
          <bitfield name="ACINT2" caption="AC2 Interrupt Disable" mask="0x10"/>
          <bitfield name="SUTINT2" caption="AC2 Startup Time Interrupt Disable" mask="0x20"/>
          <bitfield name="ACINT3" caption="AC3 Interrupt Disable" mask="0x40"/>
          <bitfield name="SUTINT3" caption="AC3 Startup Time Interrupt Disable" mask="0x80"/>
          <bitfield name="ACINT4" caption="AC4 Interrupt Disable" mask="0x100"/>
          <bitfield name="SUTINT4" caption="AC4 Startup Time Interrupt Disable" mask="0x200"/>
          <bitfield name="ACINT5" caption="AC5 Interrupt Disable" mask="0x400"/>
          <bitfield name="SUTINT5" caption="AC5 Startup Time Interrupt Disable" mask="0x800"/>
          <bitfield name="ACINT6" caption="AC6 Interrupt Disable" mask="0x1000"/>
          <bitfield name="SUTINT6" caption="AC6 Startup Time Interrupt Disable" mask="0x2000"/>
          <bitfield name="ACINT7" caption="AC7 Interrupt Disable" mask="0x4000"/>
          <bitfield name="SUTINT7" caption="AC7 Startup Time Interrupt Disable" mask="0x8000"/>
          <bitfield name="WFINT0" caption="Window0 Mode Interrupt Disable" mask="0x1000000"/>
          <bitfield name="WFINT1" caption="Window1 Mode Interrupt Disable" mask="0x2000000"/>
          <bitfield name="WFINT2" caption="Window2 Mode Interrupt Disable" mask="0x4000000"/>
          <bitfield name="WFINT3" caption="Window3 Mode Interrupt Disable" mask="0x8000000"/>
        </register>
        <register name="IMR" offset="0x18" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="ACINT0" caption="AC0 Interrupt Mask" mask="0x1"/>
          <bitfield name="SUTINT0" caption="AC0 Startup Time Interrupt Mask" mask="0x2"/>
          <bitfield name="ACINT1" caption="AC1 Interrupt Mask" mask="0x4"/>
          <bitfield name="SUTINT1" caption="AC1 Startup Time Interrupt Mask" mask="0x8"/>
          <bitfield name="ACINT2" caption="AC2 Interrupt Mask" mask="0x10"/>
          <bitfield name="SUTINT2" caption="AC2 Startup Time Interrupt Mask" mask="0x20"/>
          <bitfield name="ACINT3" caption="AC3 Interrupt Mask" mask="0x40"/>
          <bitfield name="SUTINT3" caption="AC3 Startup Time Interrupt Mask" mask="0x80"/>
          <bitfield name="ACINT4" caption="AC4 Interrupt Mask" mask="0x100"/>
          <bitfield name="SUTINT4" caption="AC4 Startup Time Interrupt Mask" mask="0x200"/>
          <bitfield name="ACINT5" caption="AC5 Interrupt Mask" mask="0x400"/>
          <bitfield name="SUTINT5" caption="AC5 Startup Time Interrupt Mask" mask="0x800"/>
          <bitfield name="ACINT6" caption="AC6 Interrupt Mask" mask="0x1000"/>
          <bitfield name="SUTINT6" caption="AC6 Startup Time Interrupt Mask" mask="0x2000"/>
          <bitfield name="ACINT7" caption="AC7 Interrupt Mask" mask="0x4000"/>
          <bitfield name="SUTINT7" caption="AC7 Startup Time Interrupt Mask" mask="0x8000"/>
          <bitfield name="WFINT0" caption="Window0 Mode Interrupt Mask" mask="0x1000000"/>
          <bitfield name="WFINT1" caption="Window1 Mode Interrupt Mask" mask="0x2000000"/>
          <bitfield name="WFINT2" caption="Window2 Mode Interrupt Mask" mask="0x4000000"/>
          <bitfield name="WFINT3" caption="Window3 Mode Interrupt Mask" mask="0x8000000"/>
        </register>
        <register name="ISR" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="ACINT0" caption="AC0 Interrupt Status" mask="0x1"/>
          <bitfield name="SUTINT0" caption="AC0 Startup Time Interrupt Status" mask="0x2"/>
          <bitfield name="ACINT1" caption="AC1 Interrupt Status" mask="0x4"/>
          <bitfield name="SUTINT1" caption="AC1 Startup Time Interrupt Status" mask="0x8"/>
          <bitfield name="ACINT2" caption="AC2 Interrupt Status" mask="0x10"/>
          <bitfield name="SUTINT2" caption="AC2 Startup Time Interrupt Status" mask="0x20"/>
          <bitfield name="ACINT3" caption="AC3 Interrupt Status" mask="0x40"/>
          <bitfield name="SUTINT3" caption="AC3 Startup Time Interrupt Status" mask="0x80"/>
          <bitfield name="ACINT4" caption="AC4 Interrupt Status" mask="0x100"/>
          <bitfield name="SUTINT4" caption="AC4 Startup Time Interrupt Status" mask="0x200"/>
          <bitfield name="ACINT5" caption="AC5 Interrupt Status" mask="0x400"/>
          <bitfield name="SUTINT5" caption="AC5 Startup Time Interrupt Status" mask="0x800"/>
          <bitfield name="ACINT6" caption="AC6 Interrupt Status" mask="0x1000"/>
          <bitfield name="SUTINT6" caption="AC6 Startup Time Interrupt Status" mask="0x2000"/>
          <bitfield name="ACINT7" caption="AC7 Interrupt Status" mask="0x4000"/>
          <bitfield name="SUTINT7" caption="AC7 Startup Time Interrupt Status" mask="0x8000"/>
          <bitfield name="WFINT0" caption="Window0 Mode Interrupt Status" mask="0x1000000"/>
          <bitfield name="WFINT1" caption="Window1 Mode Interrupt Status" mask="0x2000000"/>
          <bitfield name="WFINT2" caption="Window2 Mode Interrupt Status" mask="0x4000000"/>
          <bitfield name="WFINT3" caption="Window3 Mode Interrupt Status" mask="0x8000000"/>
        </register>
        <register name="ICR" offset="0x20" rw="W" size="4" access-size="4" atomic-op="clear:ISR" initval="0x00000000" caption="Interrupt Status Clear Register">
          <bitfield name="ACINT0" caption="AC0 Interrupt Status Clear" mask="0x1"/>
          <bitfield name="SUTINT0" caption="AC0 Startup Time Interrupt Status Clear" mask="0x2"/>
          <bitfield name="ACINT1" caption="AC1 Interrupt Status Clear" mask="0x4"/>
          <bitfield name="SUTINT1" caption="AC1 Startup Time Interrupt Status Clear" mask="0x8"/>
          <bitfield name="ACINT2" caption="AC2 Interrupt Status Clear" mask="0x10"/>
          <bitfield name="SUTINT2" caption="AC2 Startup Time Interrupt Status Clear" mask="0x20"/>
          <bitfield name="ACINT3" caption="AC3 Interrupt Status Clear" mask="0x40"/>
          <bitfield name="SUTINT3" caption="AC3 Startup Time Interrupt Status Clear" mask="0x80"/>
          <bitfield name="ACINT4" caption="AC4 Interrupt Status Clear" mask="0x100"/>
          <bitfield name="SUTINT4" caption="AC4 Startup Time Interrupt Status Clear" mask="0x200"/>
          <bitfield name="ACINT5" caption="AC5 Interrupt Status Clear" mask="0x400"/>
          <bitfield name="SUTINT5" caption="AC5 Startup Time Interrupt Status Clear" mask="0x800"/>
          <bitfield name="ACINT6" caption="AC6 Interrupt Status Clear" mask="0x1000"/>
          <bitfield name="SUTINT6" caption="AC6 Startup Time Interrupt Status Clear" mask="0x2000"/>
          <bitfield name="ACINT7" caption="AC7 Interrupt Status Clear" mask="0x4000"/>
          <bitfield name="SUTINT7" caption="AC7 Startup Time Interrupt Status Clear" mask="0x8000"/>
          <bitfield name="WFINT0" caption="Window0 Mode Interrupt Status Clear" mask="0x1000000"/>
          <bitfield name="WFINT1" caption="Window1 Mode Interrupt Status Clear" mask="0x2000000"/>
          <bitfield name="WFINT2" caption="Window2 Mode Interrupt Status Clear" mask="0x4000000"/>
          <bitfield name="WFINT3" caption="Window3 Mode Interrupt Status Clear" mask="0x8000000"/>
        </register>
        <register name="TR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Test Register">
          <bitfield name="ACTEST0" caption="AC0 Output Override Value" mask="0x1"/>
          <bitfield name="ACTEST1" caption="AC1 Output Override Value" mask="0x2"/>
          <bitfield name="ACTEST2" caption="AC2 Output Override Value" mask="0x4"/>
          <bitfield name="ACTEST3" caption="AC3 Output Override Value" mask="0x8"/>
          <bitfield name="ACTEST4" caption="AC4 Output Override Value" mask="0x10"/>
          <bitfield name="ACTEST5" caption="AC5 Output Override Value" mask="0x20"/>
          <bitfield name="ACTEST6" caption="AC6 Output Override Value" mask="0x40"/>
          <bitfield name="ACTEST7" caption="AC7 Output Override Value" mask="0x80"/>
        </register>
        <register name="PARAMETER" offset="0x30" rw="R" size="4" access-size="4" caption="Parameter Register">
          <bitfield name="ACIMPL0" caption="Analog Comparator 0 Implemented" mask="0x1"/>
          <bitfield name="ACIMPL1" caption="Analog Comparator 1 Implemented" mask="0x2"/>
          <bitfield name="ACIMPL2" caption="Analog Comparator 2 Implemented" mask="0x4"/>
          <bitfield name="ACIMPL3" caption="Analog Comparator 3 Implemented" mask="0x8"/>
          <bitfield name="ACIMPL4" caption="Analog Comparator 4 Implemented" mask="0x10"/>
          <bitfield name="ACIMPL5" caption="Analog Comparator 5 Implemented" mask="0x20"/>
          <bitfield name="ACIMPL6" caption="Analog Comparator 6 Implemented" mask="0x40"/>
          <bitfield name="ACIMPL7" caption="Analog Comparator 7 Implemented" mask="0x80"/>
          <bitfield name="WIMPL0" caption="Window0 Mode  Implemented" mask="0x10000"/>
          <bitfield name="WIMPL1" caption="Window1 Mode  Implemented" mask="0x20000"/>
          <bitfield name="WIMPL2" caption="Window2 Mode  Implemented" mask="0x40000"/>
          <bitfield name="WIMPL3" caption="Window3 Mode  Implemented" mask="0x80000"/>
        </register>
        <register name="VERSION" offset="0x34" rw="R" size="4" access-size="4" initval="0x00000101" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
        <register name="CONFW" offset="0x80" rw="RW" size="4" access-size="4" count="4" initval="0x00000000" caption="Window configuration Register">
          <bitfield name="WIS" caption="Window Mode Interrupt Settings" mask="0x7"/>
          <bitfield name="WEVSRC" caption="Peripheral Event Sourse Selection for Window Mode" mask="0x700"/>
          <bitfield name="WEVEN" caption="Window Peripheral Event Enable" mask="0x800"/>
          <bitfield name="WFEN" caption="Window Mode Enable" mask="0x10000"/>
        </register>
        <register name="CONF" offset="0xD0" rw="RW" size="4" access-size="4" count="8" initval="0x00000000" caption="AC Configuration Register">
          <bitfield name="IS" caption="Interupt Settings" mask="0x3"/>
          <bitfield name="MODE" caption="Analog Comparator Mode" mask="0x30"/>
          <bitfield name="INSELN" caption="Negative Input Select" mask="0x300"/>
          <bitfield name="EVENN" caption="Peripheral Event Enable Negative" mask="0x10000"/>
          <bitfield name="EVENP" caption="Peripheral Event Enable Positive" mask="0x20000"/>
          <bitfield name="HYS" caption="Hysteresis Voltage Value" mask="0x3000000"/>
          <bitfield name="FAST" caption="Fast Mode Enable" mask="0x4000000"/>
          <bitfield name="ALWAYSON" caption="Always On" mask="0x8000000"/>
        </register>
      </register-group>
    </module>
