turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LS8B.atdf
        <register name="EVERC" offset="0x188" rw="W" size="4" access-size="4" atomic-op="clear:EVER" caption="Event Enable Register - Clear">
          <bitfield name="P0" caption="Event Enable" mask="0x1"/>
          <bitfield name="P1" caption="Event Enable" mask="0x2"/>
          <bitfield name="P2" caption="Event Enable" mask="0x4"/>
          <bitfield name="P3" caption="Event Enable" mask="0x8"/>
          <bitfield name="P4" caption="Event Enable" mask="0x10"/>
          <bitfield name="P5" caption="Event Enable" mask="0x20"/>
          <bitfield name="P6" caption="Event Enable" mask="0x40"/>
          <bitfield name="P7" caption="Event Enable" mask="0x80"/>
          <bitfield name="P8" caption="Event Enable" mask="0x100"/>
          <bitfield name="P9" caption="Event Enable" mask="0x200"/>
          <bitfield name="P10" caption="Event Enable" mask="0x400"/>
          <bitfield name="P11" caption="Event Enable" mask="0x800"/>
          <bitfield name="P12" caption="Event Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Event Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Event Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Event Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Event Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Event Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Event Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Event Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Event Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Event Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Event Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Event Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Event Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Event Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Event Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Event Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Event Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Event Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Event Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Event Enable" mask="0x80000000"/>
        </register>
        <register name="EVERT" offset="0x18C" rw="W" size="4" access-size="4" atomic-op="toggle:EVER" caption="Event Enable Register - Toggle">
          <bitfield name="P0" caption="Event Enable" mask="0x1"/>
          <bitfield name="P1" caption="Event Enable" mask="0x2"/>
          <bitfield name="P2" caption="Event Enable" mask="0x4"/>
          <bitfield name="P3" caption="Event Enable" mask="0x8"/>
          <bitfield name="P4" caption="Event Enable" mask="0x10"/>
          <bitfield name="P5" caption="Event Enable" mask="0x20"/>
          <bitfield name="P6" caption="Event Enable" mask="0x40"/>
          <bitfield name="P7" caption="Event Enable" mask="0x80"/>
          <bitfield name="P8" caption="Event Enable" mask="0x100"/>
          <bitfield name="P9" caption="Event Enable" mask="0x200"/>
          <bitfield name="P10" caption="Event Enable" mask="0x400"/>
          <bitfield name="P11" caption="Event Enable" mask="0x800"/>
          <bitfield name="P12" caption="Event Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Event Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Event Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Event Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Event Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Event Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Event Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Event Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Event Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Event Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Event Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Event Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Event Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Event Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Event Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Event Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Event Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Event Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Event Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Event Enable" mask="0x80000000"/>
        </register>
        <register name="LOCK" offset="0x1A0" rw="RW" size="4" access-size="4" caption="Lock Register">
          <bitfield name="P0" caption="Lock State" mask="0x1"/>
          <bitfield name="P1" caption="Lock State" mask="0x2"/>
          <bitfield name="P2" caption="Lock State" mask="0x4"/>
          <bitfield name="P3" caption="Lock State" mask="0x8"/>
          <bitfield name="P4" caption="Lock State" mask="0x10"/>
          <bitfield name="P5" caption="Lock State" mask="0x20"/>
          <bitfield name="P6" caption="Lock State" mask="0x40"/>
          <bitfield name="P7" caption="Lock State" mask="0x80"/>
          <bitfield name="P8" caption="Lock State" mask="0x100"/>
          <bitfield name="P9" caption="Lock State" mask="0x200"/>
          <bitfield name="P10" caption="Lock State" mask="0x400"/>
          <bitfield name="P11" caption="Lock State" mask="0x800"/>
          <bitfield name="P12" caption="Lock State" mask="0x1000"/>
          <bitfield name="P13" caption="Lock State" mask="0x2000"/>
          <bitfield name="P14" caption="Lock State" mask="0x4000"/>
          <bitfield name="P15" caption="Lock State" mask="0x8000"/>
          <bitfield name="P16" caption="Lock State" mask="0x10000"/>
          <bitfield name="P17" caption="Lock State" mask="0x20000"/>
          <bitfield name="P18" caption="Lock State" mask="0x40000"/>
          <bitfield name="P19" caption="Lock State" mask="0x80000"/>
          <bitfield name="P20" caption="Lock State" mask="0x100000"/>
          <bitfield name="P21" caption="Lock State" mask="0x200000"/>
          <bitfield name="P22" caption="Lock State" mask="0x400000"/>
          <bitfield name="P23" caption="Lock State" mask="0x800000"/>
          <bitfield name="P24" caption="Lock State" mask="0x1000000"/>
          <bitfield name="P25" caption="Lock State" mask="0x2000000"/>
          <bitfield name="P26" caption="Lock State" mask="0x4000000"/>
          <bitfield name="P27" caption="Lock State" mask="0x8000000"/>
          <bitfield name="P28" caption="Lock State" mask="0x10000000"/>
          <bitfield name="P29" caption="Lock State" mask="0x20000000"/>
          <bitfield name="P30" caption="Lock State" mask="0x40000000"/>
          <bitfield name="P31" caption="Lock State" mask="0x80000000"/>
        </register>
        <register name="LOCKS" offset="0x1A4" rw="W" size="4" access-size="4" atomic-op="set:LOCK" caption="Lock Register - Set">
          <bitfield name="P0" caption="Lock State" mask="0x1"/>
          <bitfield name="P1" caption="Lock State" mask="0x2"/>
          <bitfield name="P2" caption="Lock State" mask="0x4"/>
          <bitfield name="P3" caption="Lock State" mask="0x8"/>
          <bitfield name="P4" caption="Lock State" mask="0x10"/>
          <bitfield name="P5" caption="Lock State" mask="0x20"/>
          <bitfield name="P6" caption="Lock State" mask="0x40"/>
          <bitfield name="P7" caption="Lock State" mask="0x80"/>
          <bitfield name="P8" caption="Lock State" mask="0x100"/>
          <bitfield name="P9" caption="Lock State" mask="0x200"/>
          <bitfield name="P10" caption="Lock State" mask="0x400"/>
          <bitfield name="P11" caption="Lock State" mask="0x800"/>
          <bitfield name="P12" caption="Lock State" mask="0x1000"/>
          <bitfield name="P13" caption="Lock State" mask="0x2000"/>
          <bitfield name="P14" caption="Lock State" mask="0x4000"/>
          <bitfield name="P15" caption="Lock State" mask="0x8000"/>
          <bitfield name="P16" caption="Lock State" mask="0x10000"/>
          <bitfield name="P17" caption="Lock State" mask="0x20000"/>
          <bitfield name="P18" caption="Lock State" mask="0x40000"/>
          <bitfield name="P19" caption="Lock State" mask="0x80000"/>
          <bitfield name="P20" caption="Lock State" mask="0x100000"/>
          <bitfield name="P21" caption="Lock State" mask="0x200000"/>
          <bitfield name="P22" caption="Lock State" mask="0x400000"/>
          <bitfield name="P23" caption="Lock State" mask="0x800000"/>
          <bitfield name="P24" caption="Lock State" mask="0x1000000"/>
          <bitfield name="P25" caption="Lock State" mask="0x2000000"/>
          <bitfield name="P26" caption="Lock State" mask="0x4000000"/>
          <bitfield name="P27" caption="Lock State" mask="0x8000000"/>
          <bitfield name="P28" caption="Lock State" mask="0x10000000"/>
          <bitfield name="P29" caption="Lock State" mask="0x20000000"/>
          <bitfield name="P30" caption="Lock State" mask="0x40000000"/>
          <bitfield name="P31" caption="Lock State" mask="0x80000000"/>
        </register>
