turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LS8B.atdf
        <register name="RHR" offset="0x14" rw="R" size="4" access-size="4" initval="0x00000000" caption="Receive Holding Register">
          <bitfield name="RXDATA" caption="Received Data" mask="0xFF"/>
        </register>
        <register name="THR" offset="0x18" rw="W" size="4" access-size="4" initval="0x00000000" caption="Transmit Holding Register">
          <bitfield name="TXDATA" caption="Data to Transmit" mask="0xFF"/>
        </register>
        <register name="SR" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000002" caption="Status Register">
          <bitfield name="RXRDY" caption="RHR Data Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="THR Data Ready" mask="0x2"/>
          <bitfield name="CRDY" caption="Ready for More Commands" mask="0x4"/>
          <bitfield name="CCOMP" caption="Command Complete" mask="0x8"/>
          <bitfield name="IDLE" caption="Master Interface is Idle" mask="0x10"/>
          <bitfield name="BUSFREE" caption="Two-wire Bus is Free" mask="0x20"/>
          <bitfield name="ANAK" caption="NAK in Address Phase Received" mask="0x100"/>
          <bitfield name="DNAK" caption="NAK in Data Phase Received" mask="0x200"/>
          <bitfield name="ARBLST" caption="Arbitration Lost" mask="0x400"/>
          <bitfield name="SMBALERT" caption="SMBus Alert" mask="0x800"/>
          <bitfield name="TOUT" caption="Timeout" mask="0x1000"/>
          <bitfield name="PECERR" caption="PEC Error" mask="0x2000"/>
          <bitfield name="STOP" caption="Stop Request Accepted" mask="0x4000"/>
          <bitfield name="MENB" caption="Master Interface Enable" mask="0x10000"/>
          <bitfield name="HSMCACK" caption="ACK in HS-mode Master Code Phase Received" mask="0x20000"/>
        </register>
        <register name="IER" offset="0x20" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="RXRDY" caption="RHR Data Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="THR Data Ready" mask="0x2"/>
          <bitfield name="CRDY" caption="Ready for More Commands" mask="0x4"/>
          <bitfield name="CCOMP" caption="Command Complete" mask="0x8"/>
          <bitfield name="IDLE" caption="Master Interface is Idle" mask="0x10"/>
          <bitfield name="BUSFREE" caption="Two-wire Bus is Free" mask="0x20"/>
          <bitfield name="ANAK" caption="NAK in Address Phase Received" mask="0x100"/>
          <bitfield name="DNAK" caption="NAK in Data Phase Received" mask="0x200"/>
          <bitfield name="ARBLST" caption="Arbitration Lost" mask="0x400"/>
          <bitfield name="SMBALERT" caption="SMBus Alert" mask="0x800"/>
          <bitfield name="TOUT" caption="Timeout" mask="0x1000"/>
          <bitfield name="PECERR" caption="PEC Error" mask="0x2000"/>
          <bitfield name="STOP" caption="Stop Request Accepted" mask="0x4000"/>
          <bitfield name="HSMCACK" caption="ACK in HS-mode Master Code Phase Received" mask="0x20000"/>
        </register>
        <register name="IDR" offset="0x24" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="RXRDY" caption="RHR Data Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="THR Data Ready" mask="0x2"/>
          <bitfield name="CRDY" caption="Ready for More Commands" mask="0x4"/>
          <bitfield name="CCOMP" caption="Command Complete" mask="0x8"/>
          <bitfield name="IDLE" caption="Master Interface is Idle" mask="0x10"/>
          <bitfield name="BUSFREE" caption="Two-wire Bus is Free" mask="0x20"/>
          <bitfield name="ANAK" caption="NAK in Address Phase Received" mask="0x100"/>
          <bitfield name="DNAK" caption="NAK in Data Phase Received" mask="0x200"/>
          <bitfield name="ARBLST" caption="Arbitration Lost" mask="0x400"/>
          <bitfield name="SMBALERT" caption="SMBus Alert" mask="0x800"/>
          <bitfield name="TOUT" caption="Timeout" mask="0x1000"/>
          <bitfield name="PECERR" caption="PEC Error" mask="0x2000"/>
          <bitfield name="STOP" caption="Stop Request Accepted" mask="0x4000"/>
          <bitfield name="HSMCACK" caption="ACK in HS-mode Master Code Phase Received" mask="0x20000"/>
        </register>
        <register name="IMR" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="RXRDY" caption="RHR Data Ready" mask="0x1"/>
          <bitfield name="TXRDY" caption="THR Data Ready" mask="0x2"/>
          <bitfield name="CRDY" caption="Ready for More Commands" mask="0x4"/>
          <bitfield name="CCOMP" caption="Command Complete" mask="0x8"/>
          <bitfield name="IDLE" caption="Master Interface is Idle" mask="0x10"/>
          <bitfield name="BUSFREE" caption="Two-wire Bus is Free" mask="0x20"/>
          <bitfield name="ANAK" caption="NAK in Address Phase Received" mask="0x100"/>
          <bitfield name="DNAK" caption="NAK in Data Phase Received" mask="0x200"/>
          <bitfield name="ARBLST" caption="Arbitration Lost" mask="0x400"/>
          <bitfield name="SMBALERT" caption="SMBus Alert" mask="0x800"/>
          <bitfield name="TOUT" caption="Timeout" mask="0x1000"/>
          <bitfield name="PECERR" caption="PEC Error" mask="0x2000"/>
          <bitfield name="STOP" caption="Stop Request Accepted" mask="0x4000"/>
          <bitfield name="HSMCACK" caption="ACK in HS-mode Master Code Phase Received" mask="0x20000"/>
        </register>
        <register name="SCR" offset="0x2C" rw="W" size="4" access-size="4" atomic-op="clear:SR" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="CCOMP" caption="Command Complete" mask="0x8"/>
          <bitfield name="ANAK" caption="NAK in Address Phase Received" mask="0x100"/>
          <bitfield name="DNAK" caption="NAK in Data Phase Received" mask="0x200"/>
          <bitfield name="ARBLST" caption="Arbitration Lost" mask="0x400"/>
          <bitfield name="SMBALERT" caption="SMBus Alert" mask="0x800"/>
          <bitfield name="TOUT" caption="Timeout" mask="0x1000"/>
          <bitfield name="PECERR" caption="PEC Error" mask="0x2000"/>
          <bitfield name="STOP" caption="Stop Request Accepted" mask="0x4000"/>
          <bitfield name="HSMCACK" caption="ACK in HS-mode Master Code Phase Received" mask="0x20000"/>
        </register>
