turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LS8B.atdf
        <register name="UPCON0CLR" offset="0x620" rw="W" size="4" access-size="4" atomic-op="clear:UPCON0" initval="0x00000000" caption="Pipe Control Clear Register">
          <bitfield name="RXINEC" caption="RXINE Clear" mask="0x1"/>
          <bitfield name="TXOUTEC" caption="TXOUTE Clear" mask="0x2"/>
          <bitfield name="TXSTPEC" caption="TXSTPE Clear" mask="0x4"/>
          <bitfield name="PERREC" caption="PERRE Clear" mask="0x8"/>
          <bitfield name="NAKEDEC" caption="NAKEDE Clear" mask="0x10"/>
          <bitfield name="ERRORFIEC" caption="ERRORFIE Clear" mask="0x20"/>
          <bitfield name="RXSTALLDEC" caption="RXTALLDE Clear" mask="0x40"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x400"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="PFREEZEC" caption="PFREEZE Clear" mask="0x20000"/>
          <bitfield name="INITDTGLC" caption="INITDTGL Clear" mask="0x40000"/>
          <bitfield name="INITBKC" caption="INITBK Clear" mask="0x80000"/>
        </register>
        <register name="UPCON1CLR" offset="0x624" rw="W" size="4" access-size="4" atomic-op="clear:UPCON1" initval="0x00000000" caption="Pipe Control Clear Register">
          <bitfield name="RXINEC" caption="RXINE Clear" mask="0x1"/>
          <bitfield name="TXOUTEC" caption="TXOUTE Clear" mask="0x2"/>
          <bitfield name="TXSTPEC" caption="TXSTPE Clear" mask="0x4"/>
          <bitfield name="PERREC" caption="PERRE Clear" mask="0x8"/>
          <bitfield name="NAKEDEC" caption="NAKEDE Clear" mask="0x10"/>
          <bitfield name="ERRORFIEC" caption="ERRORFIE Clear" mask="0x20"/>
          <bitfield name="RXSTALLDEC" caption="RXTALLDE Clear" mask="0x40"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x400"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="PFREEZEC" caption="PFREEZE Clear" mask="0x20000"/>
          <bitfield name="INITDTGLC" caption="INITDTGL Clear" mask="0x40000"/>
          <bitfield name="INITBKC" caption="INITBK Clear" mask="0x80000"/>
        </register>
        <register name="UPCON2CLR" offset="0x628" rw="W" size="4" access-size="4" atomic-op="clear:UPCON2" initval="0x00000000" caption="Pipe Control Clear Register">
          <bitfield name="RXINEC" caption="RXINE Clear" mask="0x1"/>
          <bitfield name="TXOUTEC" caption="TXOUTE Clear" mask="0x2"/>
          <bitfield name="TXSTPEC" caption="TXSTPE Clear" mask="0x4"/>
          <bitfield name="PERREC" caption="PERRE Clear" mask="0x8"/>
          <bitfield name="NAKEDEC" caption="NAKEDE Clear" mask="0x10"/>
          <bitfield name="ERRORFIEC" caption="ERRORFIE Clear" mask="0x20"/>
          <bitfield name="RXSTALLDEC" caption="RXTALLDE Clear" mask="0x40"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x400"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="PFREEZEC" caption="PFREEZE Clear" mask="0x20000"/>
          <bitfield name="INITDTGLC" caption="INITDTGL Clear" mask="0x40000"/>
          <bitfield name="INITBKC" caption="INITBK Clear" mask="0x80000"/>
        </register>
        <register name="UPCON3CLR" offset="0x62C" rw="W" size="4" access-size="4" atomic-op="clear:UPCON3" initval="0x00000000" caption="Pipe Control Clear Register">
          <bitfield name="RXINEC" caption="RXINE Clear" mask="0x1"/>
          <bitfield name="TXOUTEC" caption="TXOUTE Clear" mask="0x2"/>
          <bitfield name="TXSTPEC" caption="TXSTPE Clear" mask="0x4"/>
          <bitfield name="PERREC" caption="PERRE Clear" mask="0x8"/>
          <bitfield name="NAKEDEC" caption="NAKEDE Clear" mask="0x10"/>
          <bitfield name="ERRORFIEC" caption="ERRORFIE Clear" mask="0x20"/>
          <bitfield name="RXSTALLDEC" caption="RXTALLDE Clear" mask="0x40"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x400"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="PFREEZEC" caption="PFREEZE Clear" mask="0x20000"/>
          <bitfield name="INITDTGLC" caption="INITDTGL Clear" mask="0x40000"/>
          <bitfield name="INITBKC" caption="INITBK Clear" mask="0x80000"/>
        </register>
        <register name="UPCON4CLR" offset="0x630" rw="W" size="4" access-size="4" atomic-op="clear:UPCON4" initval="0x00000000" caption="Pipe Control Clear Register">
          <bitfield name="RXINEC" caption="RXINE Clear" mask="0x1"/>
          <bitfield name="TXOUTEC" caption="TXOUTE Clear" mask="0x2"/>
          <bitfield name="TXSTPEC" caption="TXSTPE Clear" mask="0x4"/>
          <bitfield name="PERREC" caption="PERRE Clear" mask="0x8"/>
          <bitfield name="NAKEDEC" caption="NAKEDE Clear" mask="0x10"/>
          <bitfield name="ERRORFIEC" caption="ERRORFIE Clear" mask="0x20"/>
          <bitfield name="RXSTALLDEC" caption="RXTALLDE Clear" mask="0x40"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x400"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="PFREEZEC" caption="PFREEZE Clear" mask="0x20000"/>
          <bitfield name="INITDTGLC" caption="INITDTGL Clear" mask="0x40000"/>
          <bitfield name="INITBKC" caption="INITBK Clear" mask="0x80000"/>
        </register>
        <register name="UPCON5CLR" offset="0x634" rw="W" size="4" access-size="4" atomic-op="clear:UPCON5" initval="0x00000000" caption="Pipe Control Clear Register">
          <bitfield name="RXINEC" caption="RXINE Clear" mask="0x1"/>
          <bitfield name="TXOUTEC" caption="TXOUTE Clear" mask="0x2"/>
          <bitfield name="TXSTPEC" caption="TXSTPE Clear" mask="0x4"/>
          <bitfield name="PERREC" caption="PERRE Clear" mask="0x8"/>
          <bitfield name="NAKEDEC" caption="NAKEDE Clear" mask="0x10"/>
          <bitfield name="ERRORFIEC" caption="ERRORFIE Clear" mask="0x20"/>
          <bitfield name="RXSTALLDEC" caption="RXTALLDE Clear" mask="0x40"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x400"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="PFREEZEC" caption="PFREEZE Clear" mask="0x20000"/>
          <bitfield name="INITDTGLC" caption="INITDTGL Clear" mask="0x40000"/>
          <bitfield name="INITBKC" caption="INITBK Clear" mask="0x80000"/>
        </register>
        <register name="UPCON6CLR" offset="0x638" rw="W" size="4" access-size="4" atomic-op="clear:UPCON6" initval="0x00000000" caption="Pipe Control Clear Register">
          <bitfield name="RXINEC" caption="RXINE Clear" mask="0x1"/>
          <bitfield name="TXOUTEC" caption="TXOUTE Clear" mask="0x2"/>
          <bitfield name="TXSTPEC" caption="TXSTPE Clear" mask="0x4"/>
          <bitfield name="PERREC" caption="PERRE Clear" mask="0x8"/>
          <bitfield name="NAKEDEC" caption="NAKEDE Clear" mask="0x10"/>
          <bitfield name="ERRORFIEC" caption="ERRORFIE Clear" mask="0x20"/>
          <bitfield name="RXSTALLDEC" caption="RXTALLDE Clear" mask="0x40"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x400"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="PFREEZEC" caption="PFREEZE Clear" mask="0x20000"/>
          <bitfield name="INITDTGLC" caption="INITDTGL Clear" mask="0x40000"/>
          <bitfield name="INITBKC" caption="INITBK Clear" mask="0x80000"/>
        </register>
        <register name="UPCON7CLR" offset="0x63C" rw="W" size="4" access-size="4" atomic-op="clear:UPCON7" initval="0x00000000" caption="Pipe Control Clear Register">
          <bitfield name="RXINEC" caption="RXINE Clear" mask="0x1"/>
          <bitfield name="TXOUTEC" caption="TXOUTE Clear" mask="0x2"/>
          <bitfield name="TXSTPEC" caption="TXSTPE Clear" mask="0x4"/>
          <bitfield name="PERREC" caption="PERRE Clear" mask="0x8"/>
          <bitfield name="NAKEDEC" caption="NAKEDE Clear" mask="0x10"/>
          <bitfield name="ERRORFIEC" caption="ERRORFIE Clear" mask="0x20"/>
          <bitfield name="RXSTALLDEC" caption="RXTALLDE Clear" mask="0x40"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x400"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="PFREEZEC" caption="PFREEZE Clear" mask="0x20000"/>
          <bitfield name="INITDTGLC" caption="INITDTGL Clear" mask="0x40000"/>
          <bitfield name="INITBKC" caption="INITBK Clear" mask="0x80000"/>
        </register>
        <register name="UPINRQ0" offset="0x650" rw="RW" size="4" access-size="4" initval="0x00000001" caption="Pipe In Request">
          <bitfield name="INRQ" caption="IN Request Number before Freeze" mask="0xFF"/>
          <bitfield name="INMODE" caption="IN Request Mode" mask="0x100"/>
        </register>
        <register name="UPINRQ1" offset="0x654" rw="RW" size="4" access-size="4" initval="0x00000001" caption="Pipe In Request">
          <bitfield name="INRQ" caption="IN Request Number before Freeze" mask="0xFF"/>
          <bitfield name="INMODE" caption="IN Request Mode" mask="0x100"/>
        </register>
